results/pagination/run-0/pagination-cursor-500.log
COMMAND: make pagination TYPE=cursor CURSOR_DEPTH_PAGES=500 LIMIT=20

==== OUTPUT ====

k6 run \
	-e BASE_URL=http://3.39.39.25:3000/v1 \
	-e TYPE=cursor \
	-e LIMIT=20 \
	-e OFFSET= \
	-e CURSOR_DEPTH_PAGES=500 \
	loadtest/pagination.js

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/pagination.js
        output: -

     scenarios: (100.00%) 1 scenario, 300 max VUs, 1m30s max duration (incl. graceful stop):
              * pagination_load: 100.00 iterations/s for 1m0s (maxVUs: 100-300, gracefulStop: 30s)


Run               [ 100% ] setup()
pagination_load   [   0% ]

Run               [ 100% ] setup()
pagination_load   [   0% ]

running (0m03.0s), 001/100 VUs, 69 complete and 0 interrupted iterations
pagination_load   [   1% ] 001/100 VUs  0m00.7s/1m0s  100.00 iters/s

running (0m04.0s), 001/100 VUs, 169 complete and 0 interrupted iterations
pagination_load   [   3% ] 001/100 VUs  0m01.7s/1m0s  100.00 iters/s

running (0m05.0s), 001/100 VUs, 269 complete and 0 interrupted iterations
pagination_load   [   4% ] 001/100 VUs  0m02.7s/1m0s  100.00 iters/s

running (0m06.0s), 001/100 VUs, 369 complete and 0 interrupted iterations
pagination_load   [   6% ] 001/100 VUs  0m03.7s/1m0s  100.00 iters/s

running (0m07.0s), 001/100 VUs, 469 complete and 0 interrupted iterations
pagination_load   [   8% ] 001/100 VUs  0m04.7s/1m0s  100.00 iters/s

running (0m08.0s), 001/100 VUs, 569 complete and 0 interrupted iterations
pagination_load   [   9% ] 001/100 VUs  0m05.7s/1m0s  100.00 iters/s

running (0m09.0s), 001/100 VUs, 669 complete and 0 interrupted iterations
pagination_load   [  11% ] 001/100 VUs  0m06.7s/1m0s  100.00 iters/s

running (0m10.0s), 001/100 VUs, 769 complete and 0 interrupted iterations
pagination_load   [  13% ] 001/100 VUs  0m07.7s/1m0s  100.00 iters/s

running (0m11.0s), 001/100 VUs, 869 complete and 0 interrupted iterations
pagination_load   [  14% ] 001/100 VUs  0m08.7s/1m0s  100.00 iters/s

running (0m12.0s), 001/100 VUs, 969 complete and 0 interrupted iterations
pagination_load   [  16% ] 001/100 VUs  0m09.7s/1m0s  100.00 iters/s

running (0m13.0s), 001/100 VUs, 1069 complete and 0 interrupted iterations
pagination_load   [  18% ] 001/100 VUs  0m10.7s/1m0s  100.00 iters/s

running (0m14.0s), 001/100 VUs, 1169 complete and 0 interrupted iterations
pagination_load   [  19% ] 001/100 VUs  0m11.7s/1m0s  100.00 iters/s

running (0m15.0s), 001/100 VUs, 1269 complete and 0 interrupted iterations
pagination_load   [  21% ] 001/100 VUs  0m12.7s/1m0s  100.00 iters/s

running (0m16.0s), 001/100 VUs, 1369 complete and 0 interrupted iterations
pagination_load   [  23% ] 001/100 VUs  0m13.7s/1m0s  100.00 iters/s

running (0m17.0s), 001/100 VUs, 1469 complete and 0 interrupted iterations
pagination_load   [  24% ] 001/100 VUs  0m14.7s/1m0s  100.00 iters/s

running (0m18.0s), 001/100 VUs, 1569 complete and 0 interrupted iterations
pagination_load   [  26% ] 001/100 VUs  0m15.7s/1m0s  100.00 iters/s

running (0m19.0s), 001/100 VUs, 1669 complete and 0 interrupted iterations
pagination_load   [  28% ] 001/100 VUs  0m16.7s/1m0s  100.00 iters/s

running (0m20.0s), 001/100 VUs, 1769 complete and 0 interrupted iterations
pagination_load   [  29% ] 001/100 VUs  0m17.7s/1m0s  100.00 iters/s

running (0m21.0s), 001/100 VUs, 1869 complete and 0 interrupted iterations
pagination_load   [  31% ] 001/100 VUs  0m18.7s/1m0s  100.00 iters/s

running (0m22.0s), 001/100 VUs, 1969 complete and 0 interrupted iterations
pagination_load   [  33% ] 001/100 VUs  0m19.7s/1m0s  100.00 iters/s

running (0m23.0s), 001/100 VUs, 2069 complete and 0 interrupted iterations
pagination_load   [  34% ] 001/100 VUs  0m20.7s/1m0s  100.00 iters/s

running (0m24.0s), 001/100 VUs, 2169 complete and 0 interrupted iterations
pagination_load   [  36% ] 001/100 VUs  0m21.7s/1m0s  100.00 iters/s

running (0m25.0s), 001/100 VUs, 2269 complete and 0 interrupted iterations
pagination_load   [  38% ] 001/100 VUs  0m22.7s/1m0s  100.00 iters/s

running (0m26.0s), 001/100 VUs, 2369 complete and 0 interrupted iterations
pagination_load   [  39% ] 001/100 VUs  0m23.7s/1m0s  100.00 iters/s

running (0m27.0s), 001/100 VUs, 2469 complete and 0 interrupted iterations
pagination_load   [  41% ] 001/100 VUs  0m24.7s/1m0s  100.00 iters/s

running (0m28.0s), 001/100 VUs, 2569 complete and 0 interrupted iterations
pagination_load   [  43% ] 001/100 VUs  0m25.7s/1m0s  100.00 iters/s

running (0m29.0s), 001/100 VUs, 2669 complete and 0 interrupted iterations
pagination_load   [  44% ] 001/100 VUs  0m26.7s/1m0s  100.00 iters/s

running (0m30.0s), 001/100 VUs, 2769 complete and 0 interrupted iterations
pagination_load   [  46% ] 001/100 VUs  0m27.7s/1m0s  100.00 iters/s

running (0m31.0s), 001/100 VUs, 2869 complete and 0 interrupted iterations
pagination_load   [  48% ] 001/100 VUs  0m28.7s/1m0s  100.00 iters/s

running (0m32.0s), 001/100 VUs, 2969 complete and 0 interrupted iterations
pagination_load   [  49% ] 001/100 VUs  0m29.7s/1m0s  100.00 iters/s

running (0m33.0s), 001/100 VUs, 3069 complete and 0 interrupted iterations
pagination_load   [  51% ] 001/100 VUs  0m30.7s/1m0s  100.00 iters/s

running (0m34.0s), 001/100 VUs, 3169 complete and 0 interrupted iterations
pagination_load   [  53% ] 001/100 VUs  0m31.7s/1m0s  100.00 iters/s

running (0m35.0s), 001/100 VUs, 3269 complete and 0 interrupted iterations
pagination_load   [  54% ] 001/100 VUs  0m32.7s/1m0s  100.00 iters/s

running (0m36.0s), 001/100 VUs, 3369 complete and 0 interrupted iterations
pagination_load   [  56% ] 001/100 VUs  0m33.7s/1m0s  100.00 iters/s

running (0m37.0s), 001/100 VUs, 3469 complete and 0 interrupted iterations
pagination_load   [  58% ] 001/100 VUs  0m34.7s/1m0s  100.00 iters/s

running (0m38.0s), 001/100 VUs, 3569 complete and 0 interrupted iterations
pagination_load   [  59% ] 001/100 VUs  0m35.7s/1m0s  100.00 iters/s

running (0m39.0s), 001/100 VUs, 3669 complete and 0 interrupted iterations
pagination_load   [  61% ] 001/100 VUs  0m36.7s/1m0s  100.00 iters/s

running (0m40.0s), 001/100 VUs, 3769 complete and 0 interrupted iterations
pagination_load   [  63% ] 001/100 VUs  0m37.7s/1m0s  100.00 iters/s

running (0m41.0s), 001/100 VUs, 3869 complete and 0 interrupted iterations
pagination_load   [  64% ] 001/100 VUs  0m38.7s/1m0s  100.00 iters/s

running (0m42.0s), 001/100 VUs, 3969 complete and 0 interrupted iterations
pagination_load   [  66% ] 001/100 VUs  0m39.7s/1m0s  100.00 iters/s

running (0m43.0s), 001/100 VUs, 4069 complete and 0 interrupted iterations
pagination_load   [  68% ] 001/100 VUs  0m40.7s/1m0s  100.00 iters/s

running (0m44.0s), 001/100 VUs, 4169 complete and 0 interrupted iterations
pagination_load   [  69% ] 001/100 VUs  0m41.7s/1m0s  100.00 iters/s

running (0m45.0s), 001/100 VUs, 4269 complete and 0 interrupted iterations
pagination_load   [  71% ] 001/100 VUs  0m42.7s/1m0s  100.00 iters/s

running (0m46.0s), 001/100 VUs, 4369 complete and 0 interrupted iterations
pagination_load   [  73% ] 001/100 VUs  0m43.7s/1m0s  100.00 iters/s

running (0m47.0s), 001/100 VUs, 4469 complete and 0 interrupted iterations
pagination_load   [  74% ] 001/100 VUs  0m44.7s/1m0s  100.00 iters/s

running (0m48.0s), 001/100 VUs, 4569 complete and 0 interrupted iterations
pagination_load   [  76% ] 001/100 VUs  0m45.7s/1m0s  100.00 iters/s

running (0m49.0s), 001/100 VUs, 4669 complete and 0 interrupted iterations
pagination_load   [  78% ] 001/100 VUs  0m46.7s/1m0s  100.00 iters/s

running (0m50.0s), 001/100 VUs, 4769 complete and 0 interrupted iterations
pagination_load   [  79% ] 001/100 VUs  0m47.7s/1m0s  100.00 iters/s

running (0m51.0s), 001/100 VUs, 4869 complete and 0 interrupted iterations
pagination_load   [  81% ] 001/100 VUs  0m48.7s/1m0s  100.00 iters/s

running (0m52.0s), 001/100 VUs, 4969 complete and 0 interrupted iterations
pagination_load   [  83% ] 001/100 VUs  0m49.7s/1m0s  100.00 iters/s

running (0m53.0s), 001/100 VUs, 5069 complete and 0 interrupted iterations
pagination_load   [  84% ] 001/100 VUs  0m50.7s/1m0s  100.00 iters/s

running (0m54.0s), 001/100 VUs, 5169 complete and 0 interrupted iterations
pagination_load   [  86% ] 001/100 VUs  0m51.7s/1m0s  100.00 iters/s

running (0m55.0s), 001/100 VUs, 5269 complete and 0 interrupted iterations
pagination_load   [  88% ] 001/100 VUs  0m52.7s/1m0s  100.00 iters/s

running (0m56.0s), 001/100 VUs, 5369 complete and 0 interrupted iterations
pagination_load   [  89% ] 001/100 VUs  0m53.7s/1m0s  100.00 iters/s

running (0m57.0s), 001/100 VUs, 5469 complete and 0 interrupted iterations
pagination_load   [  91% ] 001/100 VUs  0m54.7s/1m0s  100.00 iters/s

running (0m58.0s), 001/100 VUs, 5569 complete and 0 interrupted iterations
pagination_load   [  93% ] 001/100 VUs  0m55.7s/1m0s  100.00 iters/s

running (0m59.0s), 001/100 VUs, 5669 complete and 0 interrupted iterations
pagination_load   [  94% ] 001/100 VUs  0m56.7s/1m0s  100.00 iters/s

running (1m00.0s), 001/100 VUs, 5769 complete and 0 interrupted iterations
pagination_load   [  96% ] 001/100 VUs  0m57.7s/1m0s  100.00 iters/s

running (1m01.0s), 001/100 VUs, 5869 complete and 0 interrupted iterations
pagination_load   [  98% ] 001/100 VUs  0m58.7s/1m0s  100.00 iters/s

running (1m02.0s), 001/100 VUs, 5969 complete and 0 interrupted iterations
pagination_load   [  99% ] 001/100 VUs  0m59.7s/1m0s  100.00 iters/s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=5.03ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 6500    104.367021/s
    checks_succeeded...: 100.00% 6500 out of 6500
    checks_failed......: 0.00%   0 out of 6500

    ✓ setup status is 200
    ✓ status is 200

    HTTP
    http_req_duration..............: avg=4.53ms min=3.72ms med=4.43ms max=48.62ms p(90)=4.86ms p(95)=5.03ms
      { expected_response:true }...: avg=4.53ms min=3.72ms med=4.43ms max=48.62ms p(90)=4.86ms p(95)=5.03ms
    http_req_failed................: 0.00%  0 out of 6500
    http_reqs......................: 6500   104.367021/s

    EXECUTION
    iteration_duration.............: avg=4.68ms min=3.88ms med=4.57ms max=48.76ms p(90)=5.02ms p(95)=5.24ms
    iterations.....................: 6000   96.338789/s
    vus............................: 1      min=0         max=1  
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 26 MB  415 kB/s
    data_sent......................: 702 kB 11 kB/s



running (1m02.3s), 000/100 VUs, 6000 complete and 0 interrupted iterations
pagination_load ✓ [ 100% ] 000/100 VUs  1m0s  100.00 iters/s